chart correction
